# File Create

In [4]:
s = 'This is my file handling program'
file = open("demo1.txt",'w')
file.write(s)
print('File Created')
file.close()

File Created

In [7]:
# READ METHOD
file = open('demo1.txt','r')
filecontent = file.read()
print(filecontent)

This is my file handling program

In [8]:
# write a list store in file
l1 = ['Python', 'Php', 'Java', 'Angular']
file = open('demo2.txt','w')
file.writelines(l1)
print('File Created')
file.close()

File Created

In [10]:
# read a list store in file

file = open('demo2.txt','r')
filelist = file.readlines()
print(filelist)

['PythonPhpJavaAngular']

In [11]:
# append the value in file 

s = 'Python file handling'
file = open('demo1.txt','a')
file.write(s)
print('File Updated')
file.close()

File Updated

In [3]:
with open('demo1.txt') as f:
    a = f.readlines()
    print(a)
    
f = open('demo1.txt','rt')
f.close()

['This is my file handling programPython file handling']

In [ ]:
# b = open('<file_name>','<mode>')
# b.close()

In [5]:
file = open('data1.txt','x')
file.close()

In [6]:
file = open('data1.txt', 'r')
print(file.read())
file.close()

1.Anil Sah
2.Akash Sah
3.Rita Sah
4.Riya Sah
5.Ritika Sah

In [7]:
file = open('data1.txt', 'r')
x = file.read()
print(type(x))
file.close()

<class 'str'>

In [8]:
file = open('data1.txt', 'r')
x = file.read()
print(x.split('\n'))
file.close()

['1.Anil Sah', '2.Akash Sah', '3.Rita Sah', '4.Riya Sah', '5.Ritika Sah']

In [10]:
file = open('data1.txt', 'r')
# x = file.read(20)
print(file.readline())
file.close()

1.Anil Sah

In [11]:
info = str()
n = int(input('Enter N = '))
file = open('new_data.','w')
for i in range(n):
    name = input('Enter Name = ')
    phone = input('Enter Phone = ')
    data = f"{name}, {phone}\n"
    info = info+data
    
file.write(info)
file.close()

Enter N = 2
Enter Name = Anil Sah
Enter Phone = 9817853704
Enter Name = Akash Sah
Enter Phone = 9812143811

In [30]:
with open('new_data.','a') as file:
    file.write('Riya 9817763647')

In [13]:
info = str()
n = int(input('Enter N = '))
file = open('new_data.','w')
file.write('Name Phone\n')
for i in range(n):
    name = input('Enter Name = ')
    phone = input('Enter Phone = ')
    data = f"{name}, {phone}\n"
    info = info+data
    
file.write(info)
file.close()

Enter N = 3
Enter Name = Anil Sah
Enter Phone = 9817853704
Enter Name = Akash Sah
Enter Phone = 9812134811
Enter Name = Rita Sah
Enter Phone = 9844295111

In [15]:
file = open('new_data.', 'r')
x = file.read()
print(x)
file.close()

Name Phone
Anil Sah, 9817853704
Akash Sah, 9812134811
Rita Sah, 9844295111

In [16]:
info = str()
n = int(input('Enter N = '))
file = open('new_data.csv','w')
file.write('Name,Phone\n')
for i in range(n):
    name = input('Enter Name = ')
    phone = input('Enter Phone = ')
    data = f"{name},{phone}\n"
    info = info+data
    
file.write(info)
file.close()

Enter N = 3
Enter Name = anil sah
Enter Phone = 98765432
Enter Name = akash
Enter Phone = 98765432
Enter Name = rita sah
Enter Phone = 098765432

In [17]:
print(info)

anil sah,98765432
akash,98765432
rita sah,098765432

In [21]:
info = info.replace('anil sah','Anil Sah')

In [22]:
file = open('new_data.csv','w')
file.write(info)
file.close()

In [23]:
import os
if os.path.exists('data1.txt'):
    os.remove('data1.txt')
    print('the file is deleted.')
else:
    print('there is such file')

the file is deleted.

In [26]:
import shutil
src = 'new_data.csv'
dst = 'Untitled Foldered'
shutil.copy(src,dst)

'Untitled Foldered'

In [27]:
import shutil
src = 'Untitled Folder'
dst = 'Untitled Folder 1/Untitled Foldered'
shutil.copytree(src,dst)

'Untitled Folder 1/Untitled Foldered'

In [29]:
import shutil
src = 'new_data.csv'
dst = 'Untitled Folder 1/Untitled Foldered1'
shutil.move(src,dst)

'Untitled Folder 1/Untitled Foldered1\\new_data.csv'

In [2]:
b = open('data1.csv','x')
b.close()

In [5]:
import pandas as pd
df = pd.read_csv('data1.csv')  # df = DataFrame
df

   Sn    Name  Age    Address       Phone
0   1    Anil   26  Kathmandu  9817853704
1   2   Akash   12        JNK  9812134811
2   3    Rita   30   Janakpur  9844295111
3   4    Riya   10    Kataiya  9812083054
4   5  Monika   20    Kataiya  9819805433
5   6   Anita   30  Bateshwor  9804851965
6   7   Indal   35  Bateshwor  9803713054

In [6]:
import pandas as pd
df = pd.read_csv('data1.csv',nrows = 5)
df

   Sn    Name  Age    Address       Phone
0   1    Anil   26  Kathmandu  9817853704
1   2   Akash   12        JNK  9812134811
2   3    Rita   30   Janakpur  9844295111
3   4    Riya   10    Kataiya  9812083054
4   5  Monika   20    Kataiya  9819805433

In [8]:
import pandas as pd
df = pd.read_csv('data1.csv')
df.head()

   Sn    Name  Age    Address       Phone
0   1    Anil   26  Kathmandu  9817853704
1   2   Akash   12        JNK  9812134811
2   3    Rita   30   Janakpur  9844295111
3   4    Riya   10    Kataiya  9812083054
4   5  Monika   20    Kataiya  9819805433

In [12]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df.head(4)

     Name  Age    Address       Phone
Sn
1    Anil   26  Kathmandu  9817853704
2   Akash   12        JNK  9812134811
3    Rita   30   Janakpur  9844295111
4    Riya   10    Kataiya  9812083054

In [11]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df.tail(3)

      Name  Age    Address       Phone
Sn
5   Monika   20    Kataiya  9819805433
6    Anita   30  Bateshwor  9804851965
7    Indal   35  Bateshwor  9803713054

In [13]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn',usecols = ['Sn','Name','Age','Address'])
df

      Name  Age    Address
Sn
1     Anil   26  Kathmandu
2    Akash   12        JNK
3     Rita   30   Janakpur
4     Riya   10    Kataiya
5   Monika   20    Kataiya
6    Anita   30  Bateshwor
7    Indal   35  Bateshwor

In [19]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn',usecols = ['Sn','Name','Age','Address','Phone'])
df.iloc[0:5]

      Name  Age    Address       Phone
Sn
1     Anil   26  Kathmandu  9817853704
2    Akash   12        JNK  9812134811
3     Rita   30   Janakpur  9844295111
4     Riya   10    Kataiya  9812083054
5   Monika   20    Kataiya  9819805433

In [18]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn',usecols = ['Sn','Name','Age','Address'])
df.iloc[0:5,0:2]

      Name  Age
Sn
1     Anil   26
2    Akash   12
3     Rita   30
4     Riya   10
5   Monika   20

In [21]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df

      Name  Age    Address       Phone
Sn
1     Anil   26  Kathmandu  9817853704
2    Akash   12        JNK  9812134811
3     Rita   30   Janakpur  9844295111
4     Riya   10    Kataiya  9812083054
5   Monika   20    Kataiya  9819805433
6    Anita   30  Bateshwor  9804851965
7    Indal   35  Bateshwor  9803713054

In [24]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df.loc[1:3]

     Name  Age    Address       Phone
Sn
1    Anil   26  Kathmandu  9817853704
2   Akash   12        JNK  9812134811
3    Rita   30   Janakpur  9844295111

In [25]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Name')
df

        Sn  Age    Address       Phone
Name
Anil     1   26  Kathmandu  9817853704
Akash    2   12        JNK  9812134811
Rita     3   30   Janakpur  9844295111
Riya     4   10    Kataiya  9812083054
Monika   5   20    Kataiya  9819805433
Anita    6   30  Bateshwor  9804851965
Indal    7   35  Bateshwor  9803713054

In [26]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Name')
df.loc['Anil':'Monika']

        Sn  Age    Address       Phone
Name
Anil     1   26  Kathmandu  9817853704
Akash    2   12        JNK  9812134811
Rita     3   30   Janakpur  9844295111
Riya     4   10    Kataiya  9812083054
Monika   5   20    Kataiya  9819805433

In [28]:
 import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df

      Name  Age    Address       Phone
Sn
1     Anil   26  Kathmandu  9817853704
2    Akash   12        JNK  9812134811
3     Rita   30   Janakpur  9844295111
4     Riya   10    Kataiya  9812083054
5   Monika   20    Kataiya  9819805433
6    Anita   30  Bateshwor  9804851965
7    Indal   35  Bateshwor  9803713054

In [31]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df['Address']

Sn
1    Kathmandu
2          JNK
3     Janakpur
4      Kataiya
5      Kataiya
6    Bateshwor
7    Bateshwor
Name: Address, dtype: object

In [33]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df['Address'] == 'Kataiya'

Sn
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: Address, dtype: bool

In [34]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
df[df['Address'] == 'Kataiya']

      Name  Age  Address       Phone
Sn
4     Riya   10  Kataiya  9812083054
5   Monika   20  Kataiya  9819805433

In [38]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
data = df[df['Age'] > 20]
data

     Name  Age    Address       Phone
Sn
1    Anil   26  Kathmandu  9817853704
3    Rita   30   Janakpur  9844295111
6   Anita   30  Bateshwor  9804851965
7   Indal   35  Bateshwor  9803713054

In [40]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
data = df[(df['Age'] > 20) | (df['Address'] == 'Kataiya')]
data

      Name  Age    Address       Phone
Sn
1     Anil   26  Kathmandu  9817853704
3     Rita   30   Janakpur  9844295111
4     Riya   10    Kataiya  9812083054
5   Monika   20    Kataiya  9819805433
6    Anita   30  Bateshwor  9804851965
7    Indal   35  Bateshwor  9803713054

In [1]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col = 'Sn')
data = df[df['Age'] > 20]
data.to_csv('age.csv')

In [17]:
import pandas as pd
data = {'Name':['Anil','Rina','Akash'],
       'Age':[26,20,12],
       'Address':['Ktm','Jnk','Jnk']}
data['Name'].append('Rita')
data['Age'].append(30)
data['Address'].append('Lochana')
print(data)
df = pd.DataFrame(data)
df.to_json('newdata.json')

{'Name': ['Anil', 'Rina', 'Akash', 'Rita'], 'Age': [26, 20, 12, 30], 'Address': ['Ktm', 'Jnk', 'Jnk', 'Lochana']}

In [18]:
df

    Name  Age  Address
0   Anil   26      Ktm
1   Rina   20      Jnk
2  Akash   12      Jnk
3   Rita   30  Lochana

In [ ]:
import csv
fields = ['Riya','10','Kataiya']
with open('newdata.csv', 'a') as f:
    x = csv.writer(f)
    x.writerow(fields)

In [29]:
import csv
fields = ['Riya','10','Janakpur']
f = open('newdata.csv', 'a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [30]:
import csv
fields = [['Monika','10','Kataiya'],
          ['Anil','26','Kathmandu'],
         ['Rita','30','Jnk']]
f = open('newdata.csv', 'w')
x = csv.writer(f)
for i in fields:
    x.writerow(i)
f.close()

In [33]:
import csv
data = []
with open('newdata.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        data.append(row)
data

[{'Name': 'Monika', 'Age': '10', 'Address': 'Kataiya'},
 {'Name': 'Anil', 'Age': '26', 'Address': 'Kathmandu'},
 {'Name': 'Rita', 'Age': '30', 'Address': 'Jnk'}]

In [37]:
import csv
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name': 'Anil','Age':26,'Address':'KTM'},
    {'Name': 'Rita','Age':30,'Address':'JNK'}
]

csvfile = open('data.csv', 'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
    
csvfile.close()

In [2]:
import pandas as pd
df = pd.read_csv('data.csv')  # df = DataFrame
df

   Name  Age Address
0  Anil   26     KTM
1  Rita   30     JNK

In [2]:
import pandas as pd

b = open('data2.tsv','x')
b.close()

In [5]:
import pandas as pd
df = pd.read_csv('data2.tsv')  # df = DataFrame
df

   Sn          Name  Age Address     Phoneno
0   1  Anil Kr. Sah   26     KTM  9817853704
1   2      Rita Sah   30     JNK  9844295111
2   3      Riya Sah   10    Jnkp  9812143811